app/controllers/all_posts_controller.rb

SELECT posts.*, prefectures.*, categories.* FROM `posts` INNER JOIN `prefectures` ON `prefectures`.`id` = `posts`.`prefecture_id` INNER JOIN `categories` ON `categories`.`id` = `posts`.`category_id`
SELECT `categories`.* FROM `categories`
---
    def all_post



        @posts = Post.joins(:prefecture, :category).select("posts.*, prefectures.prefecture, categories.category")
        @categories = Category.all