app/controllers/new_posts_controller.rb

SELECT `prefectures`.* FROM `prefectures`
---
    def new_post

        @posts = Post.new
        @areas = Area.new
        @prefectures = Prefecture.all

INSERT INTO `posts` (`title`, `content`, `category_id`, `prefecture_id`, `accept_number`, `from_age`, `to_age`, `view_period`, `created_at`, `updated_at`) VALUES ('あいうえお', '本文だよー', 1, 1, 1, 10, 50, 3, '2019-07-21 00:58:34', '2019-07-21 00:58:34')
---
    def send_post

        @posts = Post.new(post_params)


        if @posts.save