app/controllers/post_details_controller.rb

    def post_detail



        @details = Post.joins(:category, :prefecture).where(id: params[:id]).select("posts.*, categories.*, prefectures.*")
---
SELECT posts.*, categories.*, prefectures.*, users.name users.id, users.age, users.from_area_id FROM `posts` INNER JOIN `users` ON `users`.`id` = `posts`.`user_id` INNER JOIN `categories` ON `categories`.`id` = `posts`.`category_id` INNER JOIN `prefectures` ON `prefectures`.`id` = `posts`.`prefecture_id` WHERE `posts`.`id` = 1