app/views/new_posts/new_post.html.erb

SELECT `areas`.* FROM `areas`
SELECT `prefectures`.* FROM `prefectures`
---
<div class ="pulldown" id ="area_id">場所：
<%= f.collection_select :id, Area.all, :id, :area %>

<%= f.collection_select :prefecture_id, Prefecture.all, :id, :prefecture %>

SELECT `categories`.* FROM `categories`
---
<div class ="pulldown">
カテゴリ：<%= f.collection_select :category_id, Category.all, :id, :category %>